La-guajolota/PSOC-5lp/Seguidor/Seguidor_de_linea.cydsn/codegentemp/SENSORES.h
/*******************************************************************************
* File Name: SENSORES.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_SENSORES_H) /* CY_STATUS_REG_SENSORES_H */
#define CY_STATUS_REG_SENSORES_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} SENSORES_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 SENSORES_Read(void) ;
void SENSORES_InterruptEnable(void) ;
void SENSORES_InterruptDisable(void) ;
void SENSORES_WriteMask(uint8 mask) ;
uint8 SENSORES_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define SENSORES_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define SENSORES_INPUTS              8


/***************************************
*             Registers
***************************************/

/* Status Register */
#define SENSORES_Status             (* (reg8 *) SENSORES_sts_sts_reg__STATUS_REG )
#define SENSORES_Status_PTR         (  (reg8 *) SENSORES_sts_sts_reg__STATUS_REG )
#define SENSORES_Status_Mask        (* (reg8 *) SENSORES_sts_sts_reg__MASK_REG )
#define SENSORES_Status_Aux_Ctrl    (* (reg8 *) SENSORES_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_SENSORES_H */


/* [] END OF FILE */
